# This file should contain all the record creation needed to seed the database with its default values.
# The data can then be loaded with the bin/rails db:seed command (or created alongside the database with db:setup).
#
# Examples:
#
#   movies = Movie.create([{ name: 'Star Wars' }, { name: 'Lord of the Rings' }])
#   Character.create(name: 'Luke', movie: movies.first)
AdminUser.create!(email: 'admin@example.com', password: 'password', password_confirmation: 'password') if Rails.env.development?
events = []
  events << {
    name: "Октоберфест",
    end_date: "2021-10-03".to_date,
    begin_date: "2021-09-18".to_date,
    body: "Свято пива «Октоберфест» являє собою традиційний парад мюнхенських і баварських броварень (інші пивні компанії до участі у фестивалі не допускаються), а також двохтижневий бенкет-гулянку в спеціально влаштованих на традиційному місці майданчику «Луг Терези» (нім. Theresienwiese, Терезієнвізе) великих шатрах-пивних павільйонах. Наприклад, 2008 року, коли фестиваль проводився в 175-е (від 20 вересня по 5 жовтня), таких наметів було 14, місткістю до десяти тисяч відвідувачів кожен.",
    price: true,
    place: "Берлін",
    orgranizator: "Володимир Іванович Латошманинський",
    set_image: "october-fast.jpeg"
  }
  events << {
    name: "Презентація Samsung S21",
    end_date: "2021-01-11".to_date,
    begin_date: "2021-01-10".to_date,
    body: "Samsung Galaxy S21 — смартфон компанії Samsung Electronics, який представили 14 січня 2021 року[3]. Є частиною серії Samsung Galaxy S. Фактично випущено три моделі: Samsung Galaxy S21, Samsung Galaxy S21+ та Samsung Galaxy S21 Ultra.",
    price: true,
    place: "Токіо",
    orgranizator: "Samsung Electronics",
    set_image: "s21.jpg"
  }
  events << {
    name: "'Великий' велозаїзд",
    end_date: "2021-02-12".to_date,
    begin_date: "2021-02-10".to_date,
    body: "Любительский велозаїзд по окружній дорозі міста Київ. Участь може взяти кожен бажаючий.",
    price: false,
    place: "Київ",
    orgranizator: "Товариство з обмеженою відповідальністю 'Катка'",
    set_image: "велозаїзд.jpg"
  }
  events << {
    name: "Запуск космічного коробля SpaceX",
    end_date: "2020-10-10".to_date,
    begin_date: "2020-10-10".to_date,
    body: "Space Exploration Technologies Corporation (SpaceX) — американське приватне підприємство, яке працює в галузі будівництва космічного транспорту, виробник Ракет-носіїв сімейства Falcon та космічних кораблів Dragon. Штаб квартира розташована у Готорні, Каліфорнія. Компанія створена інженером і винахідником Ілоном Маском. Компанія розробила ракети-носії Falcon 1 і Falcon 9, одразу маючи на меті зробити їх багаторазовими за рахунок повернення і повторного використання 1-го ступеню ракети. Також розроблено космічний корабель Dragon (виводиться на орбіту Falcon 9 Full Thrust), призначений для поповнення запасів на Міжнародній космічній станції. 6 лютого 2018 року під час тестового польоту ракети Falcon Heavy було запущено на ГЦО власний автомобіль Tesla Roadster Ілона Маска. Наразі SpaceX займається розробкою надважкої ракети BFR, у якої багаторазовим буде не лише нижній ступінь, а і верхній. Він буде виконаний у трьох варіантах: космічний корабель BFR (вантажна версія та пілотована) і Танкер BFR (для доставки на орбіту палива для дозаправки). У вересні 2018 року SpaceX представила першого пасажира для BFR, що полетить з туристичною місією навколо Місяця — #dearMoon. Ним став японський мільярдер Юсаку Маедзава. Для контролю якості і вартості, розробка, виробництво і тестування більшості компонентів продукції SpaceX виконується з опорою на внутрішні ресурси, зокрема ракетні двигуни Merlin, Kestrel, Draco і SuperDraco, які використовуються на ракетах-носіях Falcon і кораблі Dragon.",
    price: true,
    place: "Каліфорнія",
    orgranizator: "Space Exploration Technologies Corporation",
    set_image: "spaceX.jpg"
  }
  events << {
    name: "Вибори президента США",
    end_date: "2020-11-04".to_date,
    begin_date: "2020-11-03".to_date,
    body: "Стаття Друга Конституції передбачає, що президент і віцепрезидент США повинні бути громадянами США від народження, мати принаймні 35 років, і жити в країні протягом не менше 14 років. Кандидати на посаду президента найчастіше висуваються від однієї з партій США, у цьому випадку кожна зі сторін розробляє метод (наприклад, праймеріз), щоб обрати найкращого кандидата для висування. Традиційно, праймеріз — це непрямі вибори, у яких виборці голосують за делегата, що має підтримати певного кандидата. Члени партії офіційно номінують кандидата для висування від імені партії. Загальні вибори в листопаді також є непрямими: виборці голосують за членів колегії виборників; ці виборники, зі свого боку, безпосередньо обирають президента та віцепрезидента. Президент обирається терміном на 4 роки",
    price: false,
    place: "США",
    orgranizator: "Уряд Сполучених Штатів Америки",
    set_image: "вибори.jpg"
  }
  events << {
    name: "Перегони суперліги",
    end_date: "2021-02-15".to_date,
    begin_date: "2021-02-13".to_date,
    body: "Кільцеві перегони на спортивних авто 2015-2020 років випуску. Різні відрізки траси: асфальт, грязюка, насипи каміння - все це робить перегони більш цікавими для глядача. Приєднуйся та отримуй купу емоцій",
    price: true,
    place: "Париж",
    orgranizator: "Mersedes Corporation",
    set_image: "гонки.jpg"
  }
  events << {
    name: "Всесвітній день прання",
    end_date: "2021-08-14".to_date,
    begin_date: "2021-08-13".to_date,
    body: "День прання у всьому світі. Настав час випрати брудний одяг та зробити його чистим.",
    price: false,
    place: "Весь світ",
    orgranizator: "Всесвітнє об'єднання домогосподарок",
    set_image: "день_прання.jpg"
  }
  events << {
    name: "Дискотека в Панорамі",
    end_date: "2021-03-14".to_date,
    begin_date: "2021-03-13".to_date,
    body: "Приходь покращити настрій собі та іншим. Море позитивних емоцій, найкращі хіти, смачні напої. Вхід з 18 років.",
    price: true,
    place: "Ужгород",
    orgranizator: "Клуб-Ресторан Панорама",
    set_image: "дискотека.jpg"
  }
  events << {
    name: "Повне сонячне затемнення",
    end_date: "2021-03-03".to_date,
    begin_date: "2021-03-03".to_date,
    body: "Повне затемнення  — відбувається тоді, коли спостерігач знаходиться в тіні Місяця. У цьому разі можна спостерігати сонячну корону. Це можливо завдяки тому, що видимі кутові розміри Місяця лише трохи більші за кутові розміри Сонця і у разі повного затемнення, Місяць затьмарює повністю диск Сонця, але не затьмарює корони.",
    price: false,
    place: "Азія",
    orgranizator: "Природній супутник Землі - Місяць",
    set_image: "затемнення.jpg"
  }
  events << {
    name: "Історичний фестиваль",
    end_date: "2021-06-03".to_date,
    begin_date: "2021-06-10".to_date,
    body: "Історичний фестиваль на печерську 'Шляховий камінь', за допомогою проведення різнопланових змагань, лекцій, майстер-класів, семінарів, спрямований покращити знання мешканців Києва про історію свого міста та популяризувати історичну реконструкцію, як рух корисний для фізичного, розумового, духовного розвитку та національно-патріотичного виховання молоді!",
    price: false,
    place: "Львів",
    orgranizator: "Громадська організація 'Колоб'",
    set_image: "історичний-фестивальний.jpg"
  }
  events << {
    name: "Святкове відкриття «
Еко маркету»",
    end_date: "2021-07-06".to_date,
    begin_date: "2021-07-10".to_date,
    body: "6 липня у Ужгороді відбудеться святкове відкриття оновленого супермаркету «ЕКО маркет». Відвідувачів очікує яскраве шоу та подарунки. Спеціальний гість – відомий український співак Роман Скорпіон. Також, традиційно, покупців у цей день очікує багато знижок і спеціальних пропозицій.",
    price: false,
    place: "Ужгород",
    orgranizator: "Гнатюк Іван Янович",
    set_image: "святкове відкриття.jpg"
  }
  events << {
    name: "Святкове відкриття катку",
    end_date: "2021-01-10".to_date,
    begin_date: "2021-01-15".to_date,
    body: "Наша ковзанка розташована у самісінькому центрі міста Вишгорода, на площі перед адмінбудинком. Ми зробили це не випадково, а користуючись практикою європейських міст, де робити ковзанку в центрі міста вже стало доброю традицією. На базі ковзанки тренується команда молодих хокеїстів, віком від 5 до 8 років, яка так і називається — «Молода Країна». А ввечері, коли стихають денні справи та шалений ритм життя, на ковзанку приходить так звана «Нічна ліга». Це наша доросла хокейна команда, яка тренується по вечорах і вже дорослі чоловіки згадують дитинство та підтримують себе у «боєздатній» фізичній форміJ. На ковзанці є всі умови для вашого відпочинку — прокат ковзанів, тепле приміщення, щоб перевзутися, гарячий чай, кава, глінтвейн. Наша мета — відродити хокейні традиції Вишгороду та подарувати радість від катання дорослим та дітямJ. В майбутньому ми також плануємо зробити секцію фігурного катання, куди також будемо набирати усіх бажаючих.",
    price: false,
    place: "Вишгород",
    orgranizator: "Шевчук Катерина Анатолійович",
    set_image: "каток.jpg"
  }
  events << {
    name: "Виступ карпатських колядників",
    end_date: "2021-01-16".to_date,
    begin_date: "2021-01-16".to_date,
    body: "В Національному музеї ім. Андрія Шептицького відбудеться виступ гурту колядників із Криворівні. Справжній дух Карпат наповнить зали музею.
Чи не найглибше поєднання християнських та язичницьких вірувань знаходимо у давніх гуцульських колядах. Давня, від дідів-прадідів, традиція гуцульської коляди збереглась і до наших часів. Звуки скрипки, сопілки, автентичні тексти давніх колядок, ритмічні мелодії ритуального танцю колядників «Плєсу перенесуть усіх нас на засніжені карпатські вершини. ",
    price: false,
    place: "Львів",
    orgranizator: "Національний музей у Львові імені Андрея Шептицького",
    set_image: "коляди.jpg"
  }
  events << {
    name: "Святослав Вакарчук. Оранжерея.",
    end_date: "2021-04-02".to_date,
    begin_date: "2021-04-02".to_date,
    body: "Концерт нового музичного проєкту Святослава Вакарчука «Оранжерея» у Києві! Раді повідомити про новий музичний проект Святослава Вакарчука «ОРАНЖЕРЕЯ» та його концертний тур навесні 2021 року!",
    price: true,
    place: "Київ",
    orgranizator: "Національний музей у Львові імені Андрея Шептицького",
    set_image: "концерт.jpg"
  }
  events << {
    name: "Мотоперегони",
    end_date: "2018-09-23".to_date,
    begin_date: "2018-09-24".to_date,
    body: "З 22-го по 23 вересня команда SBK UA проведе завершальний етап шосейно-кільцевих мотогонок на треку спорткомплексу «Чайка», де прийме участь більш ніж 50 гонщиків зі всієї України. В суботній теплий день пілоти будуть проходити кваліфікацію, а в неділю вони боротимуться за звання чемпіона України 2018 року.",
    price: true,
    place: "Київ",
    orgranizator: "SBK UA Чемпіонат України з шосейно-кільцевих перегонів",
    set_image: "мотоцикли.jpeg"
  }
  events << {
    name: "Штурм Капітолія",
    end_date: "2021-01-05".to_date,
    begin_date: "2021-01-06".to_date,
    body: "5–6 січня 2021 року кілька тисяч прихильників президента Трампа, що зберуться у Вашингтоні, округ Колумбія, на знак протесту проти можливих фальсифікацій результатів президентських виборів та на підтримку вимоги Трампа до віцепрезидента Майка Пенса та Конгресу відхилити затвердження перемоги обраного президента Джо Байдена будуть штурмувати Капітолій.",
    price: false,
    place: "Вашингтон",
    orgranizator: "Donald Trump",
    set_image: "штурм_капітолія.jpeg"
  }
  events << {
    name: "ФЕСТИВАЛЬ ПОВІТРЯНИХ КУЛЬ «МОНГОЛЬФ'ЄРІЯ»",
    end_date: "2021-02-06".to_date,
    begin_date: "2021-02-06".to_date,
    body: "Ви побачите виставу величезних повітряних куль з України та Європи на ВДНГ у Києві. Вони будуть працювати для вас упродовж дня у музичному супроводі. Почніть Новий рік із яскравих вражень та подаруйте емоції особливим для вас людям!",
    price: true,
    place: "Київ",
    orgranizator: "Громадська спілка «Українське повітроплавне товариство» і Повітроплавне товариство «Монгольф'єр»",
    set_image: "політ на кулі.jpg"
  }
  events << {
    name: "Венеціанский карнавал",
    end_date: "2021-01-30".to_date,
    begin_date: "2021-02-16".to_date,
    body: "Карнавал - велике кульмінаційне свято перед Великим Постом. Він проходить по всій Італії з XI століття, але самі пишні торжества влаштовують у Венеції. Тут можна подивитися паради гондол, феєрверк на площі Святого Марка і, нарешті, відвідати один із знаменитих балів-маскарадів. Вони йдуть регулярно під час цього розкішного фестивалю.",
    price: false,
    place: "Венеція",
    orgranizator: "Італія",
    set_image: "карнавал.jpg"
  }
  events << {
    name: "День Короля в Амстердамі",
    end_date: "2021-04-27".to_date,
    begin_date: "2021-04-27".to_date,
    body: "Пакуйте помаранчеві речі в помаранчевий чемодан - час їхати на День Короля в Амстердам. Це масштабне свято в день народження люблячого яскраві фарби монарха. Знаменується він величезною вуличної вечіркою, яка збільшує населення міста майже вдвічі. Веселощі починається напередодні ввечері і триває весь день. У програмі вулична торгівля і човнові вечірки на всесвітньо відомих каналах. Обов'язково спробуйте святкову випічку Tompouce з помаранчевої глазур'ю. Це відмінне джерело енергії для активного відпочинку.",
    price: false,
    place: "Амстердам",
    orgranizator: "Нідерланди",
    set_image: "король.jpg"
  }
Event.create!(events)
