# This file should contain all the record creation needed to seed the database with its default values.
# The data can then be loaded with the bin/rails db:seed command (or created alongside the database with db:setup).
#
# Examples:
#
#   movies = Movie.create([{ name: 'Star Wars' }, { name: 'Lord of the Rings' }])
#   Character.create(name: 'Luke', movie: movies.first)
AdminUser.create!(email: 'admin@example.com', password: 'password', password_confirmation: 'password') if Rails.env.development?
events = []
  events << {
    name: "Октоберфест",
    end_date: "2021-10-03".to_date,
    begin_date: "2021-09-18".to_date,
    body: "Свято пива «Октоберфест» являє собою традиційний парад мюнхенських і баварських броварень (інші пивні компанії до участі у фестивалі не допускаються), а також двохтижневий бенкет-гулянку в спеціально влаштованих на традиційному місці майданчику «Луг Терези» (нім. Theresienwiese, Терезієнвізе) великих шатрах-пивних павільйонах. Наприклад, 2008 року, коли фестиваль проводився в 175-е (від 20 вересня по 5 жовтня), таких наметів було 14, місткістю до десяти тисяч відвідувачів кожен.",
    price: true,
    place: "Берлін",
    orgranizator: "Володимир Іванович Латошманинський",
    set_image: "october-fast.jpeg"
  }
  events << {
    name: "Презентація Samsung S21",
    end_date: "2021-01-11".to_date,
    begin_date: "2021-01-10".to_date,
    body: "Samsung Galaxy S21 — смартфон компанії Samsung Electronics, який представили 14 січня 2021 року[3]. Є частиною серії Samsung Galaxy S. Фактично випущено три моделі: Samsung Galaxy S21, Samsung Galaxy S21+ та Samsung Galaxy S21 Ultra.",
    price: true,
    place: "Токіо",
    orgranizator: "Samsung Electronics",
    set_image: "s21.jpg"
  }
  events << {
    name: "'Великий' велозаїзд",
    end_date: "2021-02-12".to_date,
    begin_date: "2021-02-10".to_date,
    body: "Любительский велозаїзд по окружній дорозі міста Київ. Участь може взяти кожен бажаючий.",
    price: false,
    place: "Київ",
    orgranizator: "Товариство з обмеженою відповідальністю 'Катка'",
    set_image: "велозаїзд.jpg"
  }
  events << {
    name: "Запуск космічного коробля SpaceX",
    end_date: "2020-10-10".to_date,
    begin_date: "2020-10-10".to_date,
    body: "Space Exploration Technologies Corporation (SpaceX) — американське приватне підприємство, яке працює в галузі будівництва космічного транспорту, виробник Ракет-носіїв сімейства Falcon та космічних кораблів Dragon. Штаб квартира розташована у Готорні, Каліфорнія. Компанія створена інженером і винахідником Ілоном Маском. Компанія розробила ракети-носії Falcon 1 і Falcon 9, одразу маючи на меті зробити їх багаторазовими за рахунок повернення і повторного використання 1-го ступеню ракети. Також розроблено космічний корабель Dragon (виводиться на орбіту Falcon 9 Full Thrust), призначений для поповнення запасів на Міжнародній космічній станції. 6 лютого 2018 року під час тестового польоту ракети Falcon Heavy було запущено на ГЦО власний автомобіль Tesla Roadster Ілона Маска. Наразі SpaceX займається розробкою надважкої ракети BFR, у якої багаторазовим буде не лише нижній ступінь, а і верхній. Він буде виконаний у трьох варіантах: космічний корабель BFR (вантажна версія та пілотована) і Танкер BFR (для доставки на орбіту палива для дозаправки). У вересні 2018 року SpaceX представила першого пасажира для BFR, що полетить з туристичною місією навколо Місяця — #dearMoon. Ним став японський мільярдер Юсаку Маедзава. Для контролю якості і вартості, розробка, виробництво і тестування більшості компонентів продукції SpaceX виконується з опорою на внутрішні ресурси, зокрема ракетні двигуни Merlin, Kestrel, Draco і SuperDraco, які використовуються на ракетах-носіях Falcon і кораблі Dragon.",
    price: true,
    place: "Каліфорнія",
    orgranizator: "Space Exploration Technologies Corporation",
    set_image: "spaceX.jpg"
  }
  events << {
    name: "Вибори президента США",
    end_date: "2020-11-04".to_date,
    begin_date: "2020-11-03".to_date,
    body: "Стаття Друга Конституції передбачає, що президент і віцепрезидент США повинні бути громадянами США від народження, мати принаймні 35 років, і жити в країні протягом не менше 14 років. Кандидати на посаду президента найчастіше висуваються від однієї з партій США, у цьому випадку кожна зі сторін розробляє метод (наприклад, праймеріз), щоб обрати найкращого кандидата для висування. Традиційно, праймеріз — це непрямі вибори, у яких виборці голосують за делегата, що має підтримати певного кандидата. Члени партії офіційно номінують кандидата для висування від імені партії. Загальні вибори в листопаді також є непрямими: виборці голосують за членів колегії виборників; ці виборники, зі свого боку, безпосередньо обирають президента та віцепрезидента. Президент обирається терміном на 4 роки",
    price: false,
    place: "США",
    orgranizator: "Уряд Сполучених Штатів Америки",
    set_image: "вибори.jpg"
  }
  events << {
    name: "Перегони суперліги",
    end_date: "2021-02-15".to_date,
    begin_date: "2021-02-13".to_date,
    body: "Кільцеві перегони на спортивних авто 2015-2020 років випуску. Різні відрізки траси: асфальт, грязюка, насипи каміння - все це робить перегони більш цікавими для глядача. Приєднуйся та отримуй купу емоцій",
    price: true,
    place: "Париж",
    orgranizator: "Mersedes Corporation",
    set_image: "гонки.jpg"
  }
  events << {
    name: "Всесвітній день прання",
    end_date: "2021-08-14".to_date,
    begin_date: "2021-08-13".to_date,
    body: "День прання у всьому світі. Настав час випрати брудний одяг та зробити його чистим.",
    price: false,
    place: "Весь світ",
    orgranizator: "Всесвітнє об'єднання домогосподарок",
    set_image: "день_прання.jpg"
  }
  events << {
    name: "Дискотека в Панорамі",
    end_date: "2021-03-14".to_date,
    begin_date: "2021-03-13".to_date,
    body: "Приходь покращити настрій собі та іншим. Море позитивних емоцій, найкращі хіти, смачні напої. Вхід з 18 років.",
    price: true,
    place: "Ужгород",
    orgranizator: "Клуб-Ресторан Панорама",
    set_image: "дискотека.jpg"
  }
  events << {
    name: "Повне сонячне затемнення",
    end_date: "2021-03-03".to_date,
    begin_date: "2021-03-03".to_date,
    body: "Повне затемнення  — відбувається тоді, коли спостерігач знаходиться в тіні Місяця. У цьому разі можна спостерігати сонячну корону. Це можливо завдяки тому, що видимі кутові розміри Місяця лише трохи більші за кутові розміри Сонця і у разі повного затемнення, Місяць затьмарює повністю диск Сонця, але не затьмарює корони.",
    price: false,
    place: "Азія",
    orgranizator: "Природній супутник Землі - Місяць",
    set_image: "затемнення.jpg"
  }
  events << {
    name: "Історичний фестиваль",
    end_date: "2021-06-03".to_date,
    begin_date: "2021-06-10".to_date,
    body: "Історичний фестиваль на печерську 'Шляховий камінь', за допомогою проведення різнопланових змагань, лекцій, майстер-класів, семінарів, спрямований покращити знання мешканців Києва про історію свого міста та популяризувати історичну реконструкцію, як рух корисний для фізичного, розумового, духовного розвитку та національно-патріотичного виховання молоді!",
    price: false,
    place: "Львів",
    orgranizator: "Громадська організація 'Колоб'",
    set_image: "історичний-фестивальний.jpg"
  }
Event.create!(events)
