app/controllers/events_controller.rb

  def index
    @events = Event.all.with_attached_images
---
SELECT "events".* FROM "events"

  def event
      @event ||= Event.find(params[:id])
---
SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]